-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/schmidt/Desktop/Research/Analysis/output/log_panel_cleaning.log
  log type:  text
 opened on:  29 Apr 2025, 00:59:57

. 
. use ./data/ACS_panel, clear

. 
. destring RUCC_2023, replace force
RUCC_2023 already numeric; no replace

. destring RUCC_2013, replace force
RUCC_2013 already numeric; no replace

. 
. // save only metro areas
. drop if (missing(RUCC_2013) & RUCC_2023 > 3) | (!missing(RUCC_2013) & RUCC_2013 > 3)
(130,684 observations deleted)

. 
. gen renters_perc = renters_units_occ / housing_units_occ
(5,394 missing values generated)

. gen people_of_c_perc = 1 - nonhisp_white_perc
(3,270 missing values generated)

. gen pct_nobachelors = 1 - perc_bach_grad_and_above
(3,547 missing values generated)

. gen threshold = 0.8 * county_med_y
(778 missing values generated)

. gen pct_below_80ami = 0

. 
. * Define locals manually
. local bins hi_05k hi_510k hi_1015k hi_1520k hi_2025k hi_2535k hi_3550k hi_5075k hi_75100k
>  hi_100150k hi_150k_plus

. local lowers 0 5000 10000 15000 20000 25000 35000 50000 75000 100000 150000

. local uppers 5000 10000 15000 20000 25000 35000 50000 75000 100000 150000 .

. 
. * Set up a counter
. local nvars : word count `bins'

. 
. * Now loop through them
. forvalues i = 1/`nvars' {
  2.     local bin : word `i' of `bins'
  3.     local lower : word `i' of `lowers'
  4.     local upper : word `i' of `uppers'
  5.   
.     quietly {
  6.         replace pct_below_80ami = pct_below_80ami + `bin' if threshold >= `upper' & !m
> issing(`bin')
  7.         replace pct_below_80ami = pct_below_80ami + (`bin' * ((threshold - `lower')/(`
> upper' - `lower'))) ///
>             if threshold > `lower' & threshold < `upper' & !missing(`bin')
  8.     }
  9. }

. 
. bysort year (zip): egen z_pct_renters = std(renters_perc)
(5,394 missing values generated)

. bysort year (zip): egen z_pct_poc = std(people_of_c_perc)
(3,270 missing values generated)

. bysort year (zip): egen z_pct_low_income = std(pct_below_80ami)
(778 missing values generated)

. bysort year (zip): egen z_pct_kids_poverty = std(hh_w_child_pov_perc)
(9,574 missing values generated)

. bysort year (zip): egen z_pct_nobachelors = std(pct_nobachelors)
(3,547 missing values generated)

. 
. gen v_renters = (z_pct_renters > 0.5)

. gen v_poc = (z_pct_poc > 0.5)

. gen v_low_income = (z_pct_low_income > 0.5)

. gen v_kids_poverty = (z_pct_kids_poverty > 0.5)

. gen v_nobachelors = (z_pct_nobachelors > 0.5)

. 
. gen total_vulnerabilities = v_renters + v_poc + v_low_income + v_kids_poverty + v_nobache
> lors

. 
. drop if total_vulnerabilities < 3
(132,486 observations deleted)

. 
. gen vulnerability = (z_pct_nobachelors + z_pct_kids_poverty + z_pct_low_income + z_pct_po
> c + z_pct_renters) / 5
(6,217 missing values generated)

. 
. drop z_pct_renters z_pct_poc z_pct_low_income z_pct_kids_poverty z_pct_nobachelors v_rent
> ers v_poc v_low_income v_kids_poverty v_nobachelors total_vulnerabilities

. 
. drop if zip == .
(778 observations deleted)

. drop if vulnerability == .
(5,439 observations deleted)

. 
. save ./data/ACS_panel_urban, replace
file ./data/ACS_panel_urban.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/schmidt/Desktop/Research/Analysis/output/log_panel_cleaning.log
  log type:  text
 closed on:  29 Apr 2025, 00:59:58
-------------------------------------------------------------------------------------------
